simulations/test_box_sh_fixed/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class volVectorField;
  object U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions[0 1 - 1 0 0 0 0];

internalField uniform(10 0 0); // Parametric speed? Set to 10 m/s for now

boundaryField {
  inlet {
    type fixedValue;
    value uniform(10 0 0);
  }

  outlet {
    type inletOutlet;
    inletValue uniform(10 0 0);
    value uniform(10 0 0);
  }

  bottom { type symmetryPlane; }

  top {
    type pressureInletOutletVelocity;
    value uniform(0 0 0);
  }

  side_left { type symmetryPlane; }

  side_right { type symmetryPlane; }

  hull {
    type noSlip; // or movingWallVelocity if ref frame changes
  }
}

// ************************************************************************* //
