simulations/test_box_sh_fixed/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class volScalarField;
  object alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions[0 0 0 0 0 0 0];

internalField uniform 0;

boundaryField {
  inlet {
    type fixedValue;
    value uniform 0; // Set by setFields
  }

  outlet {
    type zeroGradient; // or inletOutlet
  }

  bottom { type symmetryPlane; }

  top {
    type inletOutlet;
    inletValue uniform 0;
    value uniform 0;
  }

  side_left { type symmetryPlane; }

  side_right { type symmetryPlane; }

  hull { type zeroGradient; }
}

// ************************************************************************* //
