simulations/test_box_sh_fixed/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class volScalarField;
  object p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions[1 - 1 - 2 0 0 0 0];

internalField uniform 0;

boundaryField {
  inlet {
    type fixedFluxPressure;
    value uniform 0;
  }

  outlet {
    type fixedValue;
    value uniform 0;
  }

  bottom { type symmetryPlane; }

  top {
    type totalPressure;
    p0 uniform 0;
    U U;
    phi phi;
    rho rho;
    psi none;
    gamma 1;
    value uniform 0;
  }

  side_left { type symmetryPlane; }

  side_right { type symmetryPlane; }

  hull {
    type fixedFluxPressure;
    value uniform 0;
  }
}

// ************************************************************************* //
